Repository: mariamm144/25620125B
Catalog: omegat/project_save.tmx
Source language: en
Languages: es

source: Add the chocolate chips and mix for 5-10 seconds, Reverse, Speed 4 or until just combined.
es: Añade las pepitas de chocolate y mezcla durante 5-10 segundos, marcha atrás, velocidad 4 o hasta que estén bien mezcladas.

source: Add the coconut and the crushed biscuits and mix for 10 seconds, Speed 4.
es: Añade el coco y las galletas trituradas y mezcla durante 10 segundos, velocidad 4.

source: Add the condensed milk and mix for 30 seconds, Speed 5.
es: Añade la leche condensada y remuévelo durante 30 segundos, velocidad 5.

source: Add the egg, milk and vanilla extract and mix for 10 seconds, speed 3.
es: Añade el huevo, la leche y el extracto de vainilla y mezcla durante 10 segundos, velocidad 3.

source: Add the eggs, milk and cheese and mix on Reverse, Speed 3, 20 seconds.
es: Añade los huevos, la leche y el queso y mezcla en REVERSO, velocidad 3, 20 segundos.

source: Add the final 250g and mix for 20 seconds, Speed 6 (please note that you'll need to use the spatula to assist with the mixing).
es: Añade los 250g restantes y remueve durante 20 segundos, a velocidad 6 (por favor, ten en cuenta que necesitarás la espátula para removerlo).

source: Add the mashed bananas and mix for a further 20 seconds or until well combined.
es: Añade los plátanos aplastados y mezcla durante 20 segundos más o hasta que quede homogéneo.

source: Add the milk and mix for 7 seconds on Speed 4 to combine.
es: Añade la leche y mezcla durante 7 segundos a la velocidad 4.

source: Add the olive oil and saute on 100 degrees, Speed 1 for 3 minutes.
es: Añade el aceite de oliva y saltea a 100 grados, velocidad 1 durante 3 minutos.

source: Add the olive oil, plain flour and salt and mix for 8 seconds on speed 6.
es: Añade el aceite de oliva, la harina común y la sal y mezcla durante 8 segundos, velocidad 6.

source: Add the plain flour, olive oil, salt and baking powder into the Thermomix bowl and mix for 8 seconds, Speed 6 to combine.
es: Añade la harina común, el aceite de oliva, la sal y la levadura en polvo en el vaso Thermomix y mezcla durante 8 segundos, velocidad 6 para mezclar.

source: Add the ricotta, baby spinach leaves, 1 egg, nutmeg and salt and pepper to your Thermomix bowl and mix for 15 seconds on speed 4 or until all of the ingredients have combined.
es: Añade la ricotta, las hojas de espinaca baby, 1 huevo, la nuez moscada y la sal y la pimienta a tu vaso Thermomix y mezcla durante 15 segundos, velocidad 4 o hasta que todos los ingredientes se hayan mezclado.

source: Add the self-raising flour, caster sugar, baking powder, bi-carb soda, cinnamon and salt and mix for 5 seconds, Speed 4 (use the spatula to help mix).
es: Añade la harina, el azúcar,la levadura en polvo, el bicarbonato, la canela y la sal y mezcla durante 5 segundos a la velocidad 4 (utiliza la espátula para mezclar).

source: Add the self-raising flour, caster sugar, milk, eggs and vanilla extract and mix for 10 seconds, Speed 5.
es: Añade la harina con levadura, el azúcar molido, leche, huevos el extracto de vainilla, y remueve durante 10 segundos, velocidad 5.

source: Add the sweetened condensed milk and mix for 10 seconds, Speed 3.
es: Añade la leche condensada y mezcla durante 10 segundos, velocidad 3

source: Add the vanilla extract and continue to mix for 20 seconds, Speed 1.
es: Añade el extracto de vainilla y continúa mezclando por 20 segundos, velocidad 1.

source: Add the vanilla extract, honey and milk and mix together for 20 seconds, Speed 6.
es: Añade el extracto de vainilla, la miel y la leche, ymezcladurante 20 segundos, velocidad 6.

source: Add the vanilla extract, milk, eggs and self raising flour and mix for 10 seconds, Speed 4.
es: Añade el extracto de vainilla, leche, huevosy la harina con levadura, y remueve durante 10 segundos, velocidad 4

source: Add the zucchini and carrot pieces and blitz for 4 seconds, speed 6 to grate.
es: Añade los trozos de calabacín y zanahoria y tritúralos durante 4 segundos, velocidad 6 para rallarlos.

source: Add your toppings before baking and gently press them into the dough.
es: Añade los ingredientes antes de hornear y presiónalos suavemente sobre la masa.

source: Adding Nuts - Chopped walnuts, macadamias and pecans are a few of my favourite additions.
es: Nueces picadas, macadamias y pacanas son algunos de mis ingredientesfavoritos.

source: Allow to cool for 10 minutes on the baking trays before transferring to a wire rack to cool completely.
es: Deja enfriar todo en las bandejas durante 10 minutos antes de transferirlo a una bandeja de rejilla para que se enfríe completamente.

source: Allow to cool in the tray for 5 minutes before transferring to a wire rack to cool completely.
es: Deja enfriar en la bandeja durante 5 minutos antes de pasarlos a una rejilla para que se enfríe completamente.

source: Allow to cool on the tray for 5 minutes before transferring to a wire tray to cool completely.
es: Deja enfriar en la bandeja durante 5 minutos antes de transferir a una bandeja de rejilla para enfriar completamente.

source: Allow to prove for a further 15 - 30 minutes.
es: Deja reposar de 15 a 30 minutos más.

source: Allow to rest and cool before cutting.
es: Deja reposar y enfriar antes de cortarlo.

source: Allow to rest for 5 minutes or until the mixture has turned frothy.
es: Deja reposar durante 5 minutos o hasta que la mezcla se haya vuelto espumosa.

source: Allow your puff pastry sheets to defrost before pressing into the mini muffin tin.
es: Deja que tus láminas de hojaldre se descongelen antes de presionarlas en el molde para mini magdalenas.

source: Alternatively, freeze in an airtight container for up to 2 months.
es: Como alternativa, consérvalo en un taper hermético hasta 2 meses.

source: Alternatively, you can freeze leftover naan breads for up to 1 month.
es: También puedes congelar los panes naan sobrantes hasta 1 mes.

source: Amount of coffee granules - 2 heaped teaspoons will give you a very strong Thermomix iced coffee frappe.
es: Cantidad de granos de café: con 2 cucharaditas colmadas obtendrá un frappe de café helado Thermomix muy fuerte.

source: And they're freezer friendly too!
es: ¡Y también se pueden meter en el congelador!

source: Any leftover naan breads can be stored in an airtight container in the fridge or at room temperature for up to 3 days. Reheat before consuming.
es: Los panes naan que sobren se pueden guardar en un recipiente hermético en el frigorífico o a temperatura ambiente hasta 3 días. Recalentar antes de consumir.

source: Apple - use any variety you like!
es: Manzana:¡usa la variedad que quieras!

source: Author Lucy & Lauren
es: AutorasLucy y Lauren

source: AuthorLucy & Lauren
es: Autor:Lucy & Lauren

source: Bake for 10-12 minutes.
es: Hornear durante 10-12 minutos.

source: Bake for 8 - 10 minutes or until the sugar cookies are beginning to turn golden on the edge.
es: Hornea durante 8 - 10 minutos o hasta que las galletas de azúcar empiecen a dorarse por los bordes.

source: Bake in oven for 25 minutes or until golden brown on top and cooked through.
es: Hornea durante 25 minutos o hasta que se dore.

source: Baking Trays x 2
es: bandejas de horno x 2

source: Baking Tray
es: Una bandeja de horno

source: Banana Chocolate Chip Muffins
es: Muffins de plátano con pepitas de chocolate

source: Banana muffins are an absolute classic and when you add in some chocolate, you end up with something even better!
es: Los muffins de plátano son un clásico y, cuando añades pepitas de chocolate, ¡consigues hasta algo mejor!

source: Banana - the riper the better!
es: Plátano: ¡cuanto más maduro, mejor!

source: Bananas have gone bad (and shouldn't be used) if they have mould on them or a slimy liquid coming from them.
es: Los plátanos están en mal estado (y no deben utilizarse) si tienenmoho o un líquido viscoso.

source: Break the extra egg into a small bowl and lightly whisk.
es: Rompe el huevo extra en un tazón pequeño y bate ligeramente.

source: Brush one edge of the pastry with a little of the egg before using a spoon to add an approximately 3cm wide line of mixture down the centre of the pasty.
es: Pasa un cepillo por el borde de la masa con un poco de huevo antes de usar una cuchara para agregar una línea de mezcla de aproximadamente 3 cm de ancho por el centro de la masa pastelera.

source: Calories
es: Calorías

source: Calories120kcal
es: Calorías: 120kcal

source: Calories212kcal
es: Calorías: 212kcal

source: Calories283kcal
es: Calorías: 283kcal

source: Calories72kcal
es: Calorías: 72kcal

source: Calories82kcal
es: Calorías: 82kcal

source: Calories: 120kcal | Carbohydrates: 17g | Protein: 2g | Fat: 5g | Saturated Fat: 3g | Polyunsaturated Fat: 1g | Monounsaturated Fat: 1g | Trans Fat: 1g | Cholesterol: 20mg | Sodium: 65mg | Potassium: 19mg | Fiber: 1g | Sugar: 7g | Vitamin A: 167IU | Calcium: 15mg | Iron: 1mg
es: Calorías: 120kcal | Carbohidratos: 17g | Proteínas: 2g | Grasas: 5g | Grasas saturadas: 3g | Grasas poliinsaturadas: 1g | Grasas monoinsaturadas: 1g | Grasas trans: 1g | Colesterol: 20mg | Sodio: 65mg | Potasio: 19mg | Fibra: 1g | Azúcares: 7g | Vitamina A: 167IU | Calcio: 15mg | Hierro: 1mg

source: Calories: 1602kcal | Carbohydrates: 336g | Protein: 45g | Fat: 4g | Saturated Fat: 1g | Sodium: 1960mg | Potassium: 428mg | Fiber: 12g | Sugar: 1g | Calcium: 60mg | Iron: 19mg
es: Calorías: 1602kcal | Carbohidratos: 336g | Proteínas: 45g | Grasas: 4g | Grasas saturadas: 1g | Sodio: 1960mg | Potasio: 428mg | Fibra: 12g | Azúcares: 1g | Calcio: 60mg | Hierro: 19mg

source: Calories: 183kcal | Carbohydrates: 31g | Protein: 4g | Fat: 4g | Saturated Fat: 1g | Polyunsaturated Fat: 1g | Monounsaturated Fat: 3g | Sodium: 320mg | Potassium: 53mg | Fiber: 1g | Sugar: 4g | Vitamin C: 1mg | Calcium: 53mg | Iron: 2mg
es: Calorías: 183kcal | Carbohidratos: 31g | Proteínas: 4g | Grasas: 4g | Grasas saturadas: 1g | Grasas poliinsaturadas: 1g | Grasas monoinsaturadas: 3g | Sodio: 320mg | Potasio: 53mg | Fibra: 1g | Azúcares: 4g | Vitamina C: 1mg | Calcio: 53mg | Hierro: 2mg

source: Calories: 187kcal | Carbohydrates: 26g | Protein: 7g | Fat: 7g | Saturated Fat: 4g | Polyunsaturated Fat: 1g | Monounsaturated Fat: 2g | Cholesterol: 20mg | Sodium: 97mg | Potassium: 335mg | Sugar: 25g | Vitamin A: 324IU | Calcium: 235mg | Iron: 1mg
es: Calorías: 187kcal | Carbohidratos: 26g | Proteínas: 7g | Grasas: 7g | Grasas saturadas: 4g | Grasas poliinsaturadas: 1g | Grasas monoinsaturadas: 2g | Colesterol: 20mg | Sodio: 97mg | Potasio: 335mg | Azúcares: 25g | Vitamina A: 324IU | Calcio: 235mg | Hierro: 1mg

source: Calories: 199kcal | Carbohydrates: 14g | Protein: 11g | Fat: 11g | Saturated Fat: 4g | Polyunsaturated Fat: 0.4g | Monounsaturated Fat: 5g | Trans Fat: 1g | Cholesterol: 52mg | Sodium: 89mg | Potassium: 236mg | Fiber: 1g | Sugar: 1g | Vitamin A: 1715IU | Vitamin C: 3mg | Calcium: 22mg | Iron: 2mg
es: Calorías: 199kcal | Carbohidratos: 14g | Proteínas: 11g | Grasas: 11g | Grasas saturadas: 4g | Grasas poliinsaturadas: 0.4g | Grasas monoinsaturadas: 5g | Grasas trans: 1g | Colesterol: 52mg | Sodio: 89mg | Potasio: 236mg | Fibra: 1g | Azúcares: 1g | Vitamina A: 1715IU | Vitamina C: 3mg | Calcio: 22mg | Hierro: 2mg

source: Calories: 207kcal | Carbohydrates: 39g | Protein: 6g | Fat: 3g | Saturated Fat: 0.4g | Polyunsaturated Fat: 0.4g | Monounsaturated Fat: 2g | Sodium: 237mg | Potassium: 76mg | Fiber: 2g | Sugar: 0.1g | Vitamin C: 0.01mg | Calcium: 9mg | Iron: 2mg
es: Calorías: 207kcal | Carbohidratos: 39g | Proteínas: 6g | Grasas: 3g | Grasas saturadas: 0,4g | Grasas poliinsaturadas: 0,4g | Grasas monoinsaturadas: 2g | Sodio: 237mg | Potasio: 76mg | Fibra: 2g | Azúcares: 0,1g | Vitamina C: 0,01mg | Calcio: 9mg | Hierro: 2mg

source: Calories: 212kcal | Carbohydrates: 15g | Protein: 5g | Fat: 15g | Saturated Fat: 5g | Polyunsaturated Fat: 2g | Monounsaturated Fat: 8g | Trans Fat: 1g | Cholesterol: 20mg | Sodium: 154mg | Potassium: 60mg | Fiber: 1g | Sugar: 1g | Vitamin A: 397IU | Vitamin C: 1mg | Calcium: 72mg | Iron: 1mg
es: Calorías: 212kcal | Carbohidratos: 15g | Proteínas: 5g | Grasas: 15g | Grasas Saturadas: 5g | Grasas Poliinsaturadas: 2g | Grasas Monoinsaturadas: 8g | Grasas Trans: 1g | Colesterol: 20mg | Sodio: 154mg | Potasio: 60mg | Fibra: 1g | Azúcar: 1g | Vitamina A: 397IU | Vitamina C: 1mg | Calcio: 72mg | Hierro: 1mg

source: Calories: 212kcal | Carbohydrates: 26g | Protein: 4g | Fat: 10g | Saturated Fat: 6g | Polyunsaturated Fat: 1g | Monounsaturated Fat: 3g | Trans Fat: 0.4g | Cholesterol: 57mg | Sodium: 87mg | Potassium: 49mg | Fiber: 1g | Sugar: 12g | Vitamin A: 336IU | Calcium: 21mg | Iron: 0.4mg
es: Calorías: 212kcal | Carbohidratos: 26g | Proteínas: 4g | Grasas: 10g | Grasas saturadas: 6g | Grasas poliinsaturadas: 1g | Grasas monoinsaturadas: 3g | Grasas trans: 0.4g | Colesterol: 57mg | Sodio: 87mg | Potasio: 49mg | Fibra: 1g | Azúcares: 12g | Vitamina A: 336IU | Calcio: 21mg | Hierro: 0.4mg

source: Calories: 250kcal | Carbohydrates: 44g | Protein: 7g | Fat: 5g | Saturated Fat: 1g | Polyunsaturated Fat: 2g | Monounsaturated Fat: 1g | Trans Fat: 1g | Cholesterol: 1mg | Sodium: 8mg | Potassium: 86mg | Fiber: 2g | Sugar: 1g | Vitamin A: 11IU | Vitamin C: 1mg | Calcium: 23mg | Iron: 3mg
es: Calorías: 250kcal | Carbohidratos: 44g | Proteínas: 7g | Grasas: 5g | Grasas saturadas: 1g | Grasas poliinsaturadas: 2g | Grasas monoinsaturadas: 1g | Grasa trans: 1g | Colesterol: 1mg | Sodio: 8mg | Potasio: 86mg | Fibra: 2g | Azúcares: 1g | Vitamina A: 11IU | Vitamina C: 1mg | Calcio: 23mg | Hierro: 3mg

source: Calories: 283kcal | Carbohydrates: 37g | Protein: 6g | Fat: 12g | Saturated Fat: 7g | Polyunsaturated Fat: 1g | Monounsaturated Fat: 3g | Trans Fat: 1g | Cholesterol: 57mg | Sodium: 114mg | Potassium: 106mg | Fiber: 1g | Sugar: 13g | Vitamin A: 417IU | Vitamin C: 2mg | Calcium: 49mg | Iron: 1mg
es: Calorías: 283kcal | Carbohidratos: 37g | Proteínas: 6g | Grasas: 12g | Grasas saturadas: 7g | Grasas poliinsaturadas: 1g | Grasas monoinsaturadas: 3g | Grasas trans: 1g | Colesterol: 57mg | Sodio: 114mg | Potasio: 106mg | Fibra: 1g | Azúcares: 13g | Vitamina A: 417IU | Vitamina C: 2mg | Calcio: 49mg | Hierro: 1mg

source: Calories: 365kcal | Carbohydrates: 38g | Protein: 4g | Fat: 24g | Saturated Fat: 14g | Polyunsaturated Fat: 2g | Monounsaturated Fat: 6g | Trans Fat: 0.2g | Cholesterol: 20mg | Sodium: 126mg | Potassium: 197mg | Fiber: 3g | Sugar: 28g | Vitamin A: 220IU | Vitamin C: 1mg | Calcium: 65mg | Iron: 1mg
es: Calorías: 365kcal | Carbohidratos: 38g | Proteínas: 4g | Grasas: 24g | Grasas Saturadas: 14g | Grasas Poliinsaturadas: 2g | Grasas Monoinsaturadas: 6g | Grasas Trans: 0. 2g | Colesterol: 20mg | Sodio: 126mg | Potasio: 197mg | Fibra: 3g | Azúcar: 28g | Vitamina A: 220IU | Vitamina C: 1mg| Calcio: 65mg | Hierro: 1mg

source: Calories: 67kcal | Carbohydrates: 6g | Protein: 2g | Fat: 4g | Saturated Fat: 1g | Polyunsaturated Fat: 1g | Monounsaturated Fat: 2g | Sodium: 228mg | Potassium: 69mg | Fiber: 2g | Sugar: 0.003g | Vitamin A: 8IU | Vitamin C: 0.2mg | Calcium: 18mg | Iron: 1mg
es: Calorías: 67kcal | Carbohidratos: 6g | Proteínas: 2g | Grasas: 4g | Grasas saturadas: 1g | Grasas poliinsaturadas: 1g | Grasas monoinsaturadas: 2g | Sodio: 228mg | Potasio: 69mg | Fibra: 2g | Azúcares: 0.003g | Vitamina A: 8IU | Vitamina C: 0.2mg | Calcio: 18mg | Hierro: 1mg

source: Calories: 72kcal | Carbohydrates: 11g | Protein: 1g | Fat: 3g | Saturated Fat: 2g | Polyunsaturated Fat: 0.3g | Monounsaturated Fat: 0.3g | Trans Fat: 0.001g | Sodium: 2mg | Potassium: 163mg | Fiber: 2g | Sugar: 6g | Vitamin A: 428IU | Vitamin C: 0.1mg | Calcium: 14mg | Iron: 1mg
es: Calorías: 72kcal | Carbohidratos: 11g | Proteínas: 1g | Grasas: 3g | Grasas saturadas: 2g | Grasas poliinsaturadas: 0.3g | Grasas monoinsaturadas: 0.3g | Grasas trans: 0.001g | Sodio: 2mg | Potasio: 163mg | Fibra: 2g | Sugar: 6g | Vitamin A: 428IU | Vitamin C: 0.1mg | Calcio: 14mg | Hierro: 1mg

source: Calories: 72kcal | Carbohydrates: 9g | Protein: 2g | Fat: 3g | Saturated Fat: 2g | Polyunsaturated Fat: 0.2g | Monounsaturated Fat: 1g | Trans Fat: 0.1g | Cholesterol: 16mg | Sodium: 26mg | Potassium: 49mg | Fiber: 0.5g | Sugar: 1g | Vitamin A: 104IU | Vitamin C: 1mg | Calcium: 13mg | Iron: 0.1mg
es: Calorías: 72kcal | Carbohidratos: 9g | Proteínas: 2g | Grasas: 3g | Grasas saturadas: 2g | Grasas poliinsaturadas: 0.2g | Grasas monoinsaturadas: 1g | Grasas trans: 0.1g | Colesterol: 16mg | Sodio: 26mg | Potasio: 49mg | Fibra: 0.5g | Azúcares: 1g | Vitamina A: 104IU | Vitamina C: 1mg | Calcio: 13mg | Hierro: 0.1mg

source: Calories: 82kcal | Carbohydrates: 9g | Protein: 1g | Fat: 5g | Saturated Fat: 3g | Polyunsaturated Fat: 0.2g | Monounsaturated Fat: 1g | Trans Fat: 0.2g | Cholesterol: 12mg | Sodium: 37mg | Potassium: 23mg | Fiber: 0.2g | Sugar: 4g | Vitamin A: 136IU | Vitamin C: 0.1mg | Calcium: 14mg | Iron: 0.1mg
es: Calorías: 82kcal | Carbohidratos: 9g | Proteínas: 1g | Grasas: 5g | Grasas saturadas: 3g | Grasas poliinsaturadas: 0.2g | Grasas monoinsaturadas: 1g | Grasas trans: 0.2g | Colesterol: 12mg | Sodio: 37mg | Potasio: 23mg | Fibra: 0.2g | Azúcares: 4g | Vitamina A: 136IU | Vitamina C: 0.1mg | Calcio: 14mg | Hierro: 0.1mg

source: Calories: 167.3kcal | Carbohydrates: 37.5g | Protein: 2.8g | Fat: 1.2g | Saturated Fat: 0.5g | Cholesterol: 15.8mg | Sodium: 315.2mg | Fiber: 1.3g | Sugar: 22.2g
es: Calorías: 167.3kcal | Carbohidratos: 37.5g | Proteínas: 2.8g | Grasas: 1.2g | Grasas saturadas: 0.5g | Colesterol: 15.8mg | Sodio: 315.2mg | Fibra: 1.3g | Azúcares: 22.2

source: Calories: 212kcal | Carbohydrates: 20g | Protein: 8g | Fat: 11g | Saturated Fat: 7g | Trans Fat: 1g | Cholesterol: 31mg | Sodium: 381mg | Potassium: 161mg | Fiber: 1g | Sugar: 1g | Vitamin A: 336IU | Calcium: 115mg | Iron: 1mg
es: Calorías: 212kcal | Carbohidratos: 20g | Proteínas: 8g | Grasas: 11g | Grasas saturadas: 7g | Grasas trans: 1g | Colesterol: 31mg | Sodio: 381mg | Potasio: 161mg | Fibra: 1g | Azúcares: 1g | Vitamina A: 336IU | Calcio: 115mg | Hierro: 1mg

source: Calories: 296kcal | Carbohydrates: 65g | Protein: 5g | Fat: 1g | Saturated Fat: 1g | Sodium: 15mg | Potassium: 62mg | Fiber: 2g | Calcium: 15mg | Iron: 1mg
es: Calorías: 296kcal | Carbohidratos: 65g | Proteínas: 5g | Grasas: 1g | Saturada Grasa: 1g | Sodio: 15mg | Potasio: 62mg | Fibra: 2g | Calcio: 15mg | Hierro: 1mg

source: Calories: 321kcal | Carbohydrates: 19g | Protein: 5g | Fat: 25g | Saturated Fat: 8g | Polyunsaturated Fat: 3g | Monounsaturated Fat: 13g | Trans Fat: 0.003g | Cholesterol: 39mg | Sodium: 158mg | Potassium: 47mg | Fiber: 1g | Sugar: 1g | Vitamin A: 101IU | Calcium: 51mg | Iron: 1mg
es: Calorías: 321kcal | Carbohidratos: 19g | Proteínas: 5g | Grasas: 25g | Grasas saturadas: 8g | Grasas poliinsaturadas: 3g | Grasas monoinsaturadas: 13g | Grasas trans: 0. 003g | Colesterol: 39mg | Sodio: 158mg | Potasio: 47mg| Fibra: 1g | Azúcares: 1g | Vitamina A: 101IU | Calcio: 51mg | Hierro: 1mg

source: Calories: 73kcal | Carbohydrates: 7g | Protein: 1g | Fat: 4g | Saturated Fat: 3g | Polyunsaturated Fat: 1g | Monounsaturated Fat: 1g | Trans Fat: 1g | Cholesterol: 18mg | Sodium: 88mg | Potassium: 23mg | Fiber: 1g | Sugar: 1g | Vitamin A: 138IU | Calcium: 13mg | Iron: 1mg
es: Calorías: 73kcal | Carbohidratos: 7g | Proteínas: 1g | Grasas: 4g | Grasas saturadas: 3g | Grasas poliinsaturadas: 1g | Grasas monoinsaturadas: 1g | Grasas trans: 1g | Colesterol: 18mg | Sodio: 88mg | Potasio: 23mg| Fibra: 1g | Azúcares: 1g | Vitamina A: 138IU | Calcio: 13mg | Hierro: 1mg

source: Calories 167.3kcal
es: Calorías 167.3kcal

source: Calories 365kcal
es: Calorías 365kcal

source: Calories 183kcal
es: Calorías 183kcal

source: Calories 207kcal
es: Calorías 207kcal

source: Calories 212kcal
es: Calorías212kcal

source: Calories 296kcal
es: Calorías296kcal

source: Calories 321kcal
es: Calorías 321kcal

source: Calories 67kcal
es: Calorías 67kcal

source: Calories 73kcal
es: Calorías73kcal

source: Calories1602kcal
es: Calorías1602kcal

source: Calories187kcal
es: Calorías187kcal

source: Calories199kcal
es: Calorías199kcal

source: Calories250kcal
es: Calorías250kcal

source: Carefully remove your Apple and Cinnamon Loaf from the oven and allow it to cool in the loaf tin for 10 minutes before transferring to a wire rack to cool completely.
es: Sácalo del horno y deja enfriar el pan de manzana con canela en las bandejas durante 10 minutos antes de pasarlas a una rejilla para que se enfríen completamente.

source: Check the consistency - If you would like a smoother hummus, add a 1-2 tbs of the reserved chickpea liquid and mix for a further 20 seconds on Speed 4.
es: Comprueba la consistencia. Si te gusta el humus más suave, añade 1 o 2 cucharadita(s) del líquido que has apartado de los garbanzos cocidos y mezcla otros 20 segundos, velocidad 4.

source: Chilling Time1 hour
es: Tiempo de descanso 1hora

source: Chilling Time 2 hours
es: Tiempo de reposo 2 horas

source: Chocolate Chips - Our muffins are completely delicious with or without chocolate chips.
es: Las pepitas de chocolate - Nuestros muffins están deliciosos con o sin pepitas.

source: Choose your favourite mini Easter eggs - I recommend using M&Ms crispy speckled eggs as they cut easily and are bright and colourful.
es: Elige tus mini huevos de Pascua favoritos. Yo recomiendo usar huevos moteados crujientes de M&Ms ya que se cortan fácilmente y son brillantes y coloridos.

source: Chop the butter and place into your Thermomix bowl.
es: Pica la mantequilla y ponla en el bol de la Thermomix.

source: Chop the dried apricots for 5 seconds, Speed 8.
es: Corta los orejones durante 5 segundos, velocidad 8.

source: Classic Thermomix Egg & Bacon Quiches that make the perfect party food or lunch box snack!
es: Las clásicas quiches de huevo y bacon de Thermomix son perfectas para una fiesta o como tentempié para el almuerzo.

source: Continue until you have used all of the mixture.
es: Continúa hasta que hayas utilizado toda la mezcla.

source: Continue until you have used all of the pikelet mixture.
es: Continúa hasta que hayas gastadotodala masa de los pikelets.

source: Cook Time12 minutes
es: Tiempo de cocina: 12minutos

source: Cook Time20 minutes
es: Tiempo de cocina: 20 minutos

source: Cook Time30 minutes
es: Tiempo de cocina: 30minutos

source: Cook Time50 minutes
es: Tiempo de cocina: 50minutos

source: Cook Time 15 minutes
es: Tiempo de cocina15 minutos

source: Cook Time 20 minutes
es: Tiempo de cocción20 minutos

source: Cook Time 25 minutes
es: Tiempo de cocina 25 minutos

source: Cook Time 30 minutes
es: Tiempo de cocción 30 minutos

source: Cook Time10 minutes
es: Tiempo de cocción10 minutos

source: Cook Time15 minutes
es: Tiempo de cocción15 minutos

source: Cook Time3 minutes
es: Tiempo de cocción3 minutos

source: Cook for 15 minutes or until the muffins spring back when lightly touched in the middle.
es: Hornea durante 15 minutos o hasta que los muffins se ablanden al tocarlas ligeramente en el centro.

source: Cook for 25 minutes and then very carefully remove the pyrex bowl and cook for a further 25 minutes or until a crust has formed and the loaf sounds hollow when tapped.
es: Hornea durante 25 minutos y, a continuación, retira con mucho cuidado el recipiente mezclador y hornea durante otros 25 minutos o hasta que se haya formado una corteza y el pan suene hueco al golpearlo.

source: Cook for 3 minutes, 60 degrees, Speed 2, or until melted.
es: Cocina durante 3 minutos, a 60 grados Velocidad 2, o hasta que se derrita.

source: Cook for approximately 10-15 minutes or until the cheese has turned golden and the middle of the quiches has cooked through.
es: Deja cocer durante unos 10-15 minutos o hasta que el queso esté dorado y el centro de las quiches esté bien cocido.
